read_verilog lzc_unopt.sv
synth_design -top lzc_unopt
opt_design
report_utilization
report_timing
report_power
